Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ ཡེ་ཤེས་ ཆེན་པོ་ དེ་ཡང་ དག་པ ར་ བསྒྲུབས་ ནས |#| འདོད་ཆགས་ དང་ །_ ཞེ་སྡང་ དང་ །_ གཏི་མུག་ སྤང་བ འི་ ཕྱིར་ དང་ །_ སྐྱེ་བ་ དང་ །_ རྒ་བ་ དང་ །_ ན་བ་ དང་ །_ འཆི་བ་ དང་ །_ སྨྲེ་སྔགས་ འདོན་པ་ དང་ །_ སྡུག་བསྔལ་བ་ དང་ །_ ཡིད་ མི་ [43b] བདེ་བ་ དང་ །_ འཁྲུག་པ་ ལས་ ཡང་དག་ པར་ འདའ་བ ར་ བྱ་བ འི་ ཕྱིར་ སེམས་ཅན་ རྣམས་ ལ་ དེ་བཞིན་ དུ་ ཆོས་ བསྟན་པ ར་ བྱ འོ་ སྙམ་ སྟེ
en: He or she is intent on accomplishing the wisdom of the buddhas, the great wisdom, thus eliminating desire, anger, and delusion. |#| So that all beings may go beyond birth, aging, sickness, death, lamentation, suffering, mental pain, [43.b] and disturbance, this person pledges to teach the Dharma to sentient beings.

source: བྱང་ཆུབ་ སེམས་དཔ འི་ དགེ་བ འི་ རྩ་བ་ ཡོངས་སུ་ སྨིན་པ ར་ བྱེད་པ་ དང་ ལྡན་པ ས་ དེ་ ཡོངས་སུ་ ཚོལ་བ་ ན་ ཚིག་ བཞི་པ འི་ ཚིགས་ སུ་ བཅད་པ་ གཅིག་ ཙམ་ ཞིག་ རྙེད་པ ར་ གྱུར་ ན །_
en: When thus involved in the process of maturing a bodhisattva’s roots of virtue, that person may search for the Dharma and find just one single verse.

source: བརྟན་པ འི་ བློ་གྲོས་ སེམས་ཅན་ ལ་ བདེ་བ འི་ རིམ་གྲོ ས་ སོ་སོ ར་ རིམ་གྲོ་ བྱས་པ འི་ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ འདི་ ལ་ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ སྔ་མ་ དེས་ བརྒྱ འི་ ཆར་ ཡང་ ཉེ་བ ར་ མི་ འགྲོ་བ་ ནས །_ |#| སྟོང་ གི་ ཆ འི་ བར་ དུ་ ཡང་ མི་ བཟོད་ ཅིང་ །_
en: Dṛḍhamati, as that person provides delightful service to sentient beings, he or she creates merit that is much larger than the former person’s merit. |#| The former merit would not even match one hundredth, or one thousandth of that.

source: གྲངས་ དང་ །_ ཆ་ དང་ །_ བགྲང་བ་ དང་ །_ རྒྱུ་ དང་ །_ དཔེ འི་ ཆར་ ཡང་ མི་ བཟོད་ དོ །།_།།
en: In fact, no number, fraction, enumeration, analogy, or comparison would suffice.

source: བརྟན་པ འི་ བློ་གྲོས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ ས་ ཇི་ལྟ ར་ སེམས་ཅན་ རྣམས་ ལ་ བདེ་བ འི་ ཡོ་བྱད་ ཇི་ལྟ་བུ ས་ སོ་སོ ར་ རིམ་གྲོ་ བྱས་པ་ ནི་ དེ་བཞིན་ གཤེགས་པ ས་ སོ་སོ ར་ མཁྱེན་ ཏེ
en: $230 “Dṛḍhamati, the Thus-Gone One is clearly aware of the different ways in which bodhisattva great beings provide delightful service to sentient beings.

source: བརྟན་པ འི་ བློ་གྲོས་ གནས་ འདི་ ལ་ ང འི་ ཉན་ཐོས་ བདེན་པ་ མཐོང་བ་ དང་ །_ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ལྷག་པ འི་ བསམ་པ་ ལ་ ཡང་དག་ པར་ ཞུགས་པ་ མ་གཏོགས་ པར་ སུ་ཞིག་ མངོན་པར་ ཡིད་ཆེས་ པར་ བྱེད །_
en: But who can trust this, Dṛḍhamati, apart from my hearers who have seen the truths, or the bodhisattva great beings with their superior intent?

source: བརྟན་པ འི་ བློ་གྲོས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ནི་ བདག་ཅག་ གིས་ སེམས་ཅན་ གནས་ མེད་པ་ རྣམས་ ཀྱི་ གནས་ སུ་ འགྱུར་བ ར་ བྱ །_ |#| སྐྱབས་ མེད་པ་ རྣམས་ ཀྱི་ སྐྱབས་ སུ་ འགྱུར་བ ར་ བྱ །_ |#| སེམས་ཅན་ གླིང་ མེད་པ་ རྣམས་ ཀྱི་ གླིང་ དུ་ འགྱུར་བ ར་ བྱ །_ |#| སེམས་ཅན་ དཔུང་གཉེན་ མེད་པ་ རྣམས་ ཀྱི་ དཔུང་གཉེན་ དུ་ འགྱུར་བ ར་ བྱ་ ཞིང་ །_
en: $231 “Dṛḍhamati, bodhisattva great beings feel, ‘We shall be the support of those who have no support, the savior of those who have no savior, the refuge of those who have no refuge, the protector of those who have no protector.

source: བདག་ཅག་ གིས་ ཐེག་པ་ ཆེན་པོ་ སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ ཡེ་ཤེས་ ཆེན་པོ་ དེ་ཡང་ དག་པ ར་ བསྒྲུབ་པ ར་ བྱ །_ |#| སེམས་ཅན་ ཚད་ མེད་ གྲངས་མེད་པ་ དག་ ཟག་པ་ མེད་པ འི་ ཆོས་ རྣམས་ ལ་ ཡང་དག་ པར་ སྦྱར་བ ར་ བྱ འོ་ སྙམ་ ནས་
en: We shall accomplish the wisdom of the buddhas, the great wisdom, and lead sentient beings beyond all limits and numbers to the undefiled qualities.’

source: དེ་ལྟ་ བུ འི་ གོ་ཆ་ གྱོན་པ ར་ བྱེད་པ་ ཡིན་ཡང་ །_
en: Such is the armor that they wear.

source: གལ་ཏེ་ སེམས་ཅན་ དེ་དག་ ལ་ སྔ་དྲོ འི་ དུས་ སུ་ རིན་པོ་ཆེ འི་ ཕུང་པོ་ རི་རབ་ དང་ མཉམ་པ་ དག་ ཉེ་བ ར་ སྦྱིན་ དགོས་པ ར་ གྱུར་ ཅིང་ །_
en: $232 “It may then be that in the morning they must provide sentient beings with a heap of jewels as large as Mount Meru, and

source: དེ་བཞིན་ དུ་ ཉི་མ འི་ གུང་ གི་ དུས་ དང་ །_ [44a] ཕྱེ་མ་ རེད་ ཀྱི་ དུས་ དང་ །_ ཉིན་མཚན་ དུ་ ཡང་ རུང་ སྟེ |#| རིན་པོ་ཆེ འི་ ཕུང་པོ་ རི་རབ་ དང་ མཉམ་པ་ དག་ ཉེ་བ ར་ སྦྱིན་ དགོས་པ ར་ གྱུར་ ལ །_
en: it may be that they have to do the same at noon, [44.a] and in the afternoon, or throughout the day and night.

source: སེམས་ཅན་ དེ་དག་ དེ་ལྟ་ བུས་ ཚིམ་པ ར་ ཡང་ མི་ འགྱུར་ ཞིང་ །_
en: However, beings may still not be satisfied and

source: འདི་ལྟར་ རྐྱེན་ དེ་དག་ གིས་ ལོག་པ ར་ ལྟུང་བ ར་ འགྲོ་བ་ དག་ ཏུ་ འགྱུར་བ འི་ གནས་ དག་ ཀྱང་ ཡོད་ ན
en: the gifts may thus become a circumstance for their depravation. |#| In that case

source: ཀྱེ་ བདག་ཅག་ གིས་ སེམས་ཅན་ དེ་དག་ འདི་ལྟར་ རེ་ཞིག་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ རིན་པོ་ཆེ ས་ བཀང་བ་ འདི་ ལ་ མཆིལ་མ་ ལྟ་བུ འི་ འདུ་ཤེས་ སྐྱེད་པ ར་ འགྱུར་བ་ དེ་ལྟ་ བུ འི་ ཆོས་ ཡོངས་སུ་ བཙལ་ བ ར་ བྱ འོ་ སྙམ་ ན་
en: bodhisattvas will think, ‘We shall pursue the Dharma whereby sentient beings will consider the entire trichiliocosm filled with precious substances to be like a glob of spit.’

source: རྫས་ བསགས་པ་ ཐ་ཆད་ གཞན་ ལ་ ལྟ་ཅི་ སྨོས །_
en: Needless then to mention what their perception of vile substances will be like.

source: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ མཁས་པ་ ནི་ རིན་པོ་ཆེ འི་ ཕུང་པོ་ དེ་ ལ་ འདི་ ནི་ འདོད་ཆགས་ དང་ །_ ཞེ་སྡང་ དང་ །_ གཏི་མུག་ གི་ རྩ་བ་ ཡིན །_ |#| སེམས་ཅན་ དམྱལ་བ འི་ སྡུག་བསྔལ་ གྱི་ རྩ་བ་ ཡིན་ དུད་འགྲོ འི་ སྐྱེ་གནས་ ཀྱི་ སྡུག་བསྔལ་ གྱི་ རྩ་བ་ ཡིན །_ |#| གཤིན་རྗེ འི་ འཇིག་རྟེན་ གྱི་ སྡུག་བསྔལ་ གྱི་ རྩ་བ་ ཡིན་ ཞིང་ལས་ ཀྱི་ ཀུན་ ནས་ སློང་བ་ རྣམ་པ་ དུ་མ འི་ རྩ་བ་ ཡིན་ ནོ་ ཞེས་ དེ་ལྟ་ བུས་ རབ་ཏུ་ རྣམ་པར་ སོགས་ པར་ བྱེད་ དེ །_ |#| དེ་ལས་ དེ་ མྱ་ངན་ ལས་ འདས་པ འི་ སེམས་ ཐོབ་ ཅིང་ རིན་པོ་ཆེ འི་ ཕུང་པོ་ དེ་ ལ་ མི་ལྟ་བ ར་ འགྱུར་ རོ །_།
en: $233 “Wise bodhisattva great beings will think, ‘This heap of jewels is the root of desire, anger, and delusion; |#| the root of the sufferings of hell, animals, and hungry spirits; |#| and the root of numerous karmic manifestations.’ |#| Starting out in this way, they attain the mind of transcendence of suffering and have no concern for any heap of jewels.

source: མཁས་པ་ ནི་ རིན་པོ་ཆེ འི་ ཕུང་པོ་ དེ་ ལ་ འདི་ ནི་ རིན་པོ་ཆེ འི་ ཕུང་པོ་ མ་ ཡིན་ གྱི །_
en: In fact, wise beings do not consider heaps of jewels to be just that. |#| Instead,

source: འདི་ ནི་ སེམས་ཅན་ དམྱལ་བ འི་ ཕུང་པོ་ ཡིན་ ཏེ །_
en: they see them as heaps of beings in hell,

source: དེ་ ལ་ ལྷག་པ ར་ ཞེན་པ འི་ སེམས་ཅན་ རྣམས་ ནི་ ལོག་པ ར་ ལྟུང་བ ར་ འགྲོ་བ ར་ འགྱུར་ རོ་ སྙམ་ དུ་ དེ་ལྟ་ བུར་ སོ་སོ ར་ རྟོག་པ ར་ བྱེད་ དོ །_།
en: because they understand that anyone who develops attachment to such things will fall into misery.

source: བརྟན་པ འི་ བློ་གྲོས་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ན་ སེམས་ཅན་ ཇི་སྙེད་ ཡོད་པ་ ལྟ་ཞོག་ གི _།
en: $234 “Now, Dṛḍhamati, let us no longer consider just all the beings within a single trichiliocosm.

source: བརྟན་པ འི་ བློ་གྲོས་ ཡོངས་སུ་ བརྟག་པ་ བཟུང་ སྟེ །_
en: Imagine instead the following.

source: ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ ཇི་སྙེད་ ཡོད་པ་ དང་ །_ དེ་བཞིན་ དུ་ ཕྱོགས་ བཅུ་ ཀུན་ དུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཇི་སྙེད་ ཡོད་པ་ དེ་དག་ ན་ སེམས་ཅན་ གཟུགས་ཅན་ ནམ །_ གཟུགས་ཅན་ མ་ཡིན་པ འམ །_ འདུ་ཤེས་ ཅན་ ནམ །_ འདུ་ཤེས་ ཅན་ མ་ཡིན་པ འམ །_ འདུ་ཤེས་ ཅན་ ཡང་ མ་ ཡིན །_ |#| འདུ་ཤེས་ ཅན་ [44b] མ་ཡིན་པ འང་ མ་ཡིན་པ་ དག་ ཡོད་པ་ དང་སེམས་ ཅན་ གྱི་ ཁམས་ སུ་ གདགས་པ ས་ གདགས་པ་ ཇི་སྙེད་ ཡོད་པ་ དེ་དག་ ཐམས་ཅད་ སྔ་ཕྱི་ མེད་པར་ མི འི་ ལུས་ ཐོབ་པ ར་ གྱུར་ ཅིང་ །_
en: Think of all the universes that extend toward the east, as abundant as the grains of sand in the river Ganges. |#| And then think of all the universes that in the same way extend in each of the ten directions. |#| Within all these universes are beings with bodies, beings without bodies, beings who are involved in perception, beings who are not involved in perception, and beings neither involved [44.b] nor not involved in perception. |#| Think of all that we in this way call ‘the realms of sentient beings.’ |#| Then imagine that, all at once, each one gains a human body.

source: སེམས་ཅན་ དེ་དག་ ལ་ བདེ་བ ར་ བྱ་བ འི་ ཕྱིར་ གང་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ སེམས་ཅན་ དེ་དག་ ལ་ གཟུགས་ རྣམས་ སམ །_ སྒྲ་ རྣམས་ སམ །_ དྲི་ རྣམས་ སམ །_ རོ་ རྣམས་ སམ །_ རེག་བྱ་ རྣམས་ ཀྱི་ བདེ་བ འི་ ཡོ་བྱད་ ཉེ་བ ར་ སྒྲུབ་པ ར་ བྱེད་པ འི་ མི་ལ་ ལ་ ཞིག་ བྱུང་བ ར་ གྱུར་ ཏེ
en: Imagine also that a man appears who always immediately provides them with whatever they might wish for in terms of enjoyable forms, sounds, smells, tastes, and textures.

source: སེམས་ཅན་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ ཕྲག་པ འམ །_ མགོ་བོ ས་ བླངས་ ནས་ |#| བསྐལ་པ འམ །_ བསྐལ་ པ་ ལས་ ལྷག་པ ར་ འཛིན་པ ར་ བྱེད་ ལ །_
en: For an eon or more, that man takes care of all these beings, carrying them on his shoulders and head.

source: སེམས་ཅན་ དེ་དག་ སྤྱོད་ལམ་ ཇི་ལྟ་བུ ས་ དེ་ ལ་ འདུག་པ ར་ འདོད་པ་ དེ་ལྟ་ བུས་ ཀྱང་ འདུག་པ ར་ གྱུར་ ཅིང་ །_
en: Whatever they wish him to do, he does. |#| And,

source: སེམས་ཅན་ དེ་དག་ གི་ བཤང་གཅི་ ཡང་ ལག་པ་ ཡ་ གཅིག་ གིས་ བླངས་ ནས་ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ གཞན་ དུ་ འདོར་ ན་
en: with one hand he sweeps away all these beings’ excrement and urine, disposing of it all in a different universe.

source: འོ་ན་ མི་ དེས་ སེམས་ཅན་ དེ་དག་ ལ་ བདེ་བ འི་ ཡོ་བྱད་ མང་པོ ས་ སོ་སོ ར་ རིམ་གྲོ་ བྱས་པ ར་ འགྱུར་ རམ །_
en: Does that man render proper service to those beings, providing them with numerous desirable things?”

source: བཅོམ་ལྡན་འདས་ མི་ དེས་ བདེ་བ འི་ ཡོ་བྱད་ མང་པོ ས་ རིམ་གྲོ་ བགྱིས་པ ར་ འགྱུར་ ལགས་སོ །_།
en: “Indeed, Blessed One, he serves them with a vast amount of enjoyable things.”

source: བརྟན་པ འི་ བློ་གྲོས་ ཁྱོད་ མོས་པ ར་ བྱ །_ |#| ཁོང་ དུ་ ཆུད་པ ར་ བྱ་ སྟེ །_
en: $235 “Dṛḍhamati,” |#| “pay attention and understand what I say.

source: མི་ དེས་ བདེ་བ འི་ ཡོ་བྱད་ དེ་ལྟ་ བུས་ རིམ་གྲོ་ བྱས་ ལ །_
en: That man serves all those beings, providing them with pleasant things.

source: རིགས་ ཀྱི་ བུ འམ་ རིགས་ ཀྱི་ བུ་མོ་ གང་ གིས་ སེམས་ཅན་ ཐམས་ཅད་ བསྐྱབ་པ་ དང་ ལྡན་པ འི་ སེམས་ ཀྱིས་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་ པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ ནས །_
en: But think now of a noble son or daughter who wishes to provide all beings with refuge, and so sets his or her mind on unexcelled and perfect awakening.

source: གང་ ལས་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ བྱང་ཆུབ་ སེམས་དཔ འི་ དགེ་བ འི་ རྩ་བ་ ཡོངས་སུ་ སྨིན་པ ར་ འགྱུར་བ འི་ བྱང་ཆུབ་ སེམས་དཔ འི་ སྡེ་སྣོད་ ཀྱི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ མཉན་པ ར་ བྱ་བ འི་ ཕྱིར་ ཐ་ན་ བྱང་ ཆུབ་ སེམས་དཔ འི་ ཆོས་ ཡོངས་སུ་ ཚོལ་བ་ ལ་ མངོན་པར་ བརྩོན་པ ར་ གྱུར་ ཅིང་ །_
en: This person wishes to listen to the teachings of the Bodhisattva Collection, the teachings whereby bodhisattvas’ roots of virtue ripen into unexcelled and perfect awakening, and may therefore diligently pursue the Dharma of the bodhisattvas.

source: བྱང་ཆུབ་ སེམས་དཔ འི་ ཆོས་ ཡོངས་སུ་ བཙལ་བ འི་ ཕྱིར་ རམ །_ དེ་ ལ་ བརྩོན་པ ར་ བྱ་བ འི་ ཕྱིར་ གོམ་པ་ འདོར་བ་ གཅིག་ གིས་ འགྲོ་བ ར་ ཡང་ བྱེད་ ན |#| བརྟན་པ འི་ བློ་གྲོས་ དགེ་བ འི་ རྩ་བ་ དེ་ ནི་ བླ་ ན་ |#| མེད་པ་ [45a] ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ ར་ སངས་ མ་ རྒྱས་ ཀྱི་ བར་ དུ་བ ར་ མ་ དོར་ ཟད་པ འམ །_ ཡོངས་སུ་ གཏུགས་པ ར་ ང་ མི་སྨྲ འོ །_།
en: If, Dṛḍhamati, that person takes even just a single step toward the pursuit and diligent practice of the bodhisattva Dharma, then the ensuing roots of virtue [45.a] will not wear out or come to an end before the attainment of unexcelled and perfect awakening.

source: བརྟན་པ འི་ བློ་གྲོས་ བདེ་བ འི་ ཡོ་བྱད་ འདི་ ལ་ བདེ་བ འི་ ཡོ་བྱད་ སྔ་མ་ དེས་ བརྒྱ འི་ ཆར་ ཡང་ ཉེ་བ ར་ མི་ འགྲོ འོ །_། |#| སྟོང་ གི་ ཆ་ དང་ །_ འབུམ་ གྱི་ ཆ་ དང་ །_ བྱེ་བ་ ཕྲག་ འབུམ་ གྱི་ ཆ་ དང་ །_ གྲངས་ དང་ །_ ཆ་ དང་ །_ བགྲང་བ་ དང་ །_ དཔེ་ དང་ །_ རྒྱུ ར་ ཡང་ མི་འགྱུར་བ འི་ ཕྱིར་ རོ །_།
en: Dṛḍhamati, the former person’s way of providing delightful service cannot match even one hundredth, or a thousandth, one hundred thousandth, or a millionth part of what is rendered by the latter. |#| In fact, no number, fraction, enumeration, analogy, or comparison would suffice.

source: བརྟན་པ འི་ བློ་གྲོས་ བདེ་བ འི་ ཡོ་བྱད་ སྔ་མ་ དེ་ ཐམས་ཅད་ ནི་ རྫས་ ལས་ བྱུང་བ་ དང་ བཅས་པ་ ཡིན་ ཏེ །_ |#| ཤིན་ཏུ་ མཐར་ཐུག་ པར་ མི་ འགྱུར་ ཞིང་ །_ ཤིན་ཏུ་ ཡོངས་སུ་ བྱང་བ ར་ མི་ འགྱུར་ ལ །_
en: Because, Dṛḍhamati, all of the former type of service is based on substance, and hence is limited and imperfect.

source: བརྟན་པ འི་ བློ་གྲོས་ ཆོས་ ཡོངས་སུ་ ཚོལ་བ་ ལ་ མངོན་པར་ བརྩོན་པ ས་ ནི་ ཚུལ་ཁྲིམས་ རྣམ་པར་ འཕེལ་བ ར་ འགྱུར །_ |#| ཏིང་ངེ་འཛིན་ རྣམ་པར་ འཕེལ་བ ར་ འགྱུར །_ |#| ཤེས་རབ་ རྣམ་པར་ འཕེལ་བ ར་ འགྱུར །_
en: $236 “Dṛḍhamati, diligent pursuit of the Dharma causes an increase in discipline, absorption, and insight.

source: སངས་རྒྱས་ ཀྱི་ ཆོས་ ཡོངས་སུ་ སྨིན་པ ར་ འགྱུར །_
en: It ripens the qualities of buddhahood.

source: ཐབས་ ལ་ མཁས་པ་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ ཡོངས་སུ་ སྨིན་པ ར་ འགྱུར །_ |#| སངས་རྒྱས་ ཀྱི་ ཞིང་ ཡོངས་སུ་ དག་པ ར་ འགྱུར་བ འི་ ཕྱིར་ ཏེ །_
en: It ripens inconceivable skillful means and purifies buddha realms.

source: དེ འི་ ཕྱིར་ དེ་ བཞིན་ གཤེགས་པ ས་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ནི་ མང་ དུ་ ཐོས་པ་ ལ་ རག་ ལས་པ ར་ བསྟན་པ་ ཡིན་ ནོ །_།
en: Hence, the Thus-Gone One has taught that unexcelled and perfect awakening depends on abundant learning.

source: བརྟན་པ འི་ བློ་གྲོས་ གལ་ཏེ་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ འདི་ལྟ་སྟེ །_ |#| འདམ་བུ འི་ ཚལ་ ལམ །_ འབྲས་ ཀྱི་ ཞིང་ ངམ །_ ཏིལ་ གྱི་ ཞིང་ ངམ །_ འོད་མ འི་ ཚལ་ བཞིན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ རྣམས་ ཀྱིས་ ཡོངས་སུ་ གང་བ ར་ གྱུར་ ལ །_
en: $237 “Dṛḍhamati, imagine that this trichiliocosm is full of thus-gone ones—as full as a grove of reeds, a paddy field, a sesame field, or a bamboo grove.

source: དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ དེ་དག་ ལ་ ཡང་ ལ་ལ་ ཞིག་ གིས་ ཇི་སྲིད་ འཚོ འི་ བར་ དུ་ བཀུར་སྟི་ བྱས །_ |#| བླ་མ ར་ བྱས །_ |#| རི་མོ ར་ བྱས་ མཆོད་པ་ བྱས་ ཤིང་ །_ ན་བཟའ་ དང་ །_ བསོད་སྙོམས་ དང་ །_ གཟིམས་ ཆ་ དང་ །_ གདན་ དང་ །_ བསྙུན་ གྱི་ གསོས་ སྨན་ དང་ །_ ཡོ་བྱད་ དག་ གིས་ བསྙེན་བཀུར་ བྱས་ ལ །_
en: Imagine then that someone spends his or her entire life paying respect to, honoring, venerating, and worshiping all those thus-gone ones, worthy ones, perfect buddhas, offering them garments, foods, bedding, mattresses, medicines, and other material things.

source: དེ་བཞིན་ གཤེགས་པ་ དེ་དག་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་ ནས་ |#| ཀྱང་ །_ སོ་སོ་ སོ་སོ ར་ ཁོར་ཡུག་ [45b] ཏུ་ དཔག་ཚད་ དང་ ལྡན་པ འི་ མཆོད་རྟེན་ རིན་པོ་ཆེ་ སྣ་ བདུན་ ལས་ བྱས་པ་ གདུགས་ བསྒྲེང་བ་ དང་ །_ སྟེགས་བུ ས་ བརྒྱན་པ །_ བསྐལ་པ ར་ གནས་པ འི་ སྣང་བ་ ཀུན་ དུ་ འབར་ རབ་ཏུ་ འབར་བ འི་ མར་མེ་ དང་ །_ མཆོད་ཡོན་ དག་ གིས་ བརྒྱན་པ་ དག་ བྱས་པ ར་ གྱུར་ ན
en: Moreover, if any one of those thus-gone ones passes completely beyond suffering that person will construct a memorial for them [45.b] that measures a league in circumference, is made of the seven precious substances, is sheltered below parasols, is adorned with altars, shines for an eon with the blazing light of oil lamps, and is adorned with beautiful offerings.

source: བརྟན་ པ འི་ བློ་གྲོས་ འདི་ ཇི་སྙམ་ དུ་ སེམས །_
en: Dṛḍhamati, what do you think?

source: འོ་ན་ རིགས་ ཀྱི་ བུ འམ །_ རིགས་ ཀྱི་ བུ་མོ་ དེས་ གཞི་ དེ་ལས་ བསོད་ནམས་ མང་ དུ་ སྐྱེད་ དམ །_
en: Will such a noble son or daughter engender abundant merit?”

source: བཅོམ་ལྡན་འདས་ རིགས་ ཀྱི་ བུ འམ །_ རིགས་ ཀྱི་ བུ་མོ་ དེས་ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ གྲངས་ མ་ མཆིས་ དཔག་ ཏུ་ མ་ མཆིས་པ་ སྐྱེད་ ལགས་སོ །_།
en: “Blessed One, that person will produce merit beyond number and measure,”

source: གང་ མི་ དེས་ ཇི་སྐད་ བཤད་པ འི་ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ དེ་ལྟ་ བུ་ སོགས་ པར་ བྱེད་ ལ །_
en: That person indeed accumulates such merit.

source: རིགས་ ཀྱི་ བུ འམ་ རིགས་ ཀྱི་ བུ་མོ ས་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ ནས་ འདི་ལྟ་སྟེ །_ |#| གང་ ལས་བྱང་ ཆུབ་ ཀྱི་ ཕྱོགས་ ཀྱི་ ཆོས་ རྣམས་ ཡོངས་སུ་ སྨིན་པ ར་ འགྱུར་བ འི་ བྱང་ཆུབ་ སེམས་དཔ འི་ སྡེ་སྣོད་ ཀྱི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཀྱི་ མདོ་སྡེ་ དེ་ལྟ་ བུ་ དག་ མཉན་པ་ དང་ །_ བསྟན་པ་ དང་ །_ བཀླག་པ་ དང་ །_ ཀུན་ ཆུབ་པ ར་ བྱ་བ འི་ ཕྱིར་ ཡོངས་སུ་ བཙལ་བ་ ལ་ བརྩོན་པ ར་ བྱེད་ ན
en: However, a noble son or daughter may develop the mind set on unexcelled and perfect awakening, and so diligently seek to listen to, teach, read, and master the sūtra teachings of the Bodhisattva Collection, the teachings that ripen the factors of awakening.

source: བརྟན་པ འི་ བློ་གྲོས་ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ འདི་ ལ་ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ སྔ་མ་ དེས་ བརྒྱ འི་ ཆར་ ཡང་ ཉེ་བ ར་ མི་ འགྲོ འོ །_། |#| སྟོང་ གི་ ཆ་ དང་ །_ འབུམ་ གྱི་ ཆ་ དང་ །_ བྱེ་བ་ ཕྲག་ འབུམ་ གྱི་ ཆ་ དང་ །_ གྲངས་ དང་ །_ ཆ་ དང་ །_ བགྲང་བ་ དང་ །_ དཔེ་ དང་ །_ རྒྱུ ར་ ཡང་ མི་ བཟོད་ དོ །_།
en: In this regard, Dṛḍhamati, the heaps of merit that are acquired by the former person cannot match even one hundredth, or a thousandth, a hundred thousandth, or a billionth part of the mass of merit that is achieved by this latter person. |#| In fact, no number, fraction, enumeration, analogy, or comparison would suffice.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་ལྟ་བས་ན་ ཁྱོད་ ཕྱི་མ འི་ ཚེ་ ཕྱི་མ འི་ དུས་ ལྔ་ བརྒྱ་པ་ ཐ་མ་ ལ་ མདོ་སྡེ་ དེ་ལྟ་ བུ་ དེ་དག་ མཉན་པ་ དང་ །_ བཟུང་བ་ དང་ །_ བཀླག་པ་ དང་ །_ ཀུན་ ཆུབ་པ ར་ བྱ་བ འི་ ཕྱིར་ གོ་ཆ་ གྱོན་པ ར་ སེམས་ ན་ བརྟན་པ འི་ བློ་གྲོས་ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ དེ འི་ ཚད་ ང་ མི་སྨྲ འོ །_།
en: $239 “Therefore, Dṛḍhamati, if you intend to don your armor for the sake of listening to, recollecting, reading, and mastering such sūtras in the future, during the final five hundred years, then, Dṛḍhamati, I shall not state any measure regarding the amount of merit that you will obtain.

source: ཡོངས་སུ་ གཏུགས་ པ ར་ ཡང་ ང་ མི་སྨྲ །_ ཡོངས་སུ་ ཟད་པ ར་ ཡང་ ང་ མི་སྨྲ འོ །_།
en: I shall mention neither limits nor an end to it.

source: བརྟན་པ འི་ བློ་གྲོས་ ཁྱོད་ སེམས་བསྐྱེད་པ འི་ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ དེ འི་ དཔེ་ཙམ་ ཐོས་པ འམ །_ ཕྱོགས་ ཙམ་ ཁོང་ དུ་ ཆུད་པ ར་ འདོད་ ན་
en: $240 “Dṛḍhamati, if you wish to hear an analogy for the amount of merit that is obtained by developing the awakened mind, or if you wish to gain just a sense of what it is like, then

source: དེ་བཞིན་ གཤེགས་པ འི་ རྫུ་འཕྲུལ་ ཡང་ ཐོས་པ འམ །_ ཡིད་ཆེས་ པར་ ནུས་ སམ །_
en: let me ask you whether you have heard of the thus-gone ones’ supernatural powers, and if you are capable of believing in them.”

source: གསོལ་ [46a] པ །_
en: replied Dṛḍhamati, [46.a]

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ཀྱི་ མཐུ ས་ རྔོ་ ཐོགས་ ལགས་སོ །_།
en: “Blessed One,” |#| “I can accept the powers of the Blessed One.”

source: སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ ཆེ་བ་ ཡིན་ ནམ །_
en: Is the trichiliocosm large?”

source: བཅོམ་ལྡན་འདས་ དེ་ ལྟ་ ལགས་སོ །_།
en: “Blessed One, yes it is,”

source: གལ་ཏེ་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ ཡུངས་འབྲུ ས་ ཡོངས་སུ་ གང་བ ར་ གྱུར་ ཅིང་ །_ |#| ཡུངས་འབྲུ་ དེ་དག་ ཇི་སྙེད་ ཡོད་པ་ དེ་སྙེད་ ཁོ་ན འི་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀྱི་ ཚད་ ཀྱི་ བྲེ་བོ་ དག་ ཡོད་པར་ གྱུར་ ལ །_ |#| དེ་དག་ ཀྱང་ བྱེ་མ་ དག་ གིས་ སོ་སོ ར་ གང་བ ར་ གྱུར་ ན
en: What if the trichiliocosm were full of sesame seeds, and each of those sesame seeds itself became a container the size of a trichiliocosm, all filled up with sand?

source: བྱེ་མ འི་ ཕུང་པོ་ དེ་ མང་བ་ ཡིན་ ནམ །_
en: Would all that amount to a large pile of sand?”

source: བཅོམ་ལྡན་འདས་ མང་ ལགས་སོ །_།
en: “Yes, Blessed One,” |#| “it would.”

source: བཅོམ་ ལྡན་འདས་ ཀྱིས་ བཀའ་ སྩལ་པ །_།
en: continued the Blessed One,

source: བརྟན་པ འི་ བློ་གྲོས་ གལ་ཏེ་ བྱེ་མ འི་ ཕུང་པོ་ དེ་ ལག་པ ས་ བླངས་ ནས་ |#| ཕྱོགས་ བཞི ར་ འདོར་བ ར་ བྱེད་པ འི་ མི་ལ་ ལ་ ཞིག་ བྱུང་བ ར་ གྱུར་ ལ །_ དེ་ འཕངས་ ནས་ དེ་ མ་ ཐག་ ཏུ་ གང་དག་ བྱེ་མ འི་ ཕུང་པོ་ དེ་ལས་ བྱེ་མ འི་ འབྲུ་ རེ་རེ་ འཇིག་རྟེན་ གྱི་ ཁམས་ རེ་རེ ར་ འཕེན་ པ ར་ བྱེད་པ འི་ རླུང་ དག་ མངོན་པར་ བྱུང་བ ར་ གྱུར་ ན
en: $243 “Dṛḍhamati,” |#| “what then if a man appeared who would grab handfuls of this sand and toss it in the four directions, and if, whenever he did so, a wind would catch each individual grain of sand and carry it into its own distinct universe?

source: ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་དག་ ཇི་སྙེད་ ཡོད་པར་ འགྱུར །_
en: How many worlds would there be in the east, and

source: ཕྱོགས་ ཐམས་ཅད་ དུ་ ཡང་ དེ་བཞིན་ ནོ །_།
en: how many would there be in the other directions?”

source: བརྟན་པ འི་ བློ་གྲོས་ ཁྱོད་ མོས་པ ར་ བྱ །_
en: $245 “Dṛḍhamati, try to imagine.

source: བརྟན་པ འི་ བློ་གྲོས་ ཁྱོད་ ཁོང་ དུ་ ཆུད་པ ར་ བྱ་ སྟེ །_
en: Dṛḍhamati, try to understand,”

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ནི་ སྤྱོད་ལམ་ གྱི་ དཔག་ ཏུ་ མེད་པ །_ ལམ་ གྱིས་ དཔག་ ཏུ་ མེད་པ །_ ཚུལ་ཁྲིམས་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ ས་ དཔག་ ཏུ་ མེད་པ །_ རྫུ་འཕྲུལ་ གྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ ས་ དཔག་ ཏུ་ མེད་པ །_ ཤེས་རབ་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ ས་ དཔག་ ཏུ་ མེད་པ་ སྟེ །_
en: “Dṛḍhamati, in the case of the thus-gone ones, the worthy ones, the perfect buddhas, their conduct, path, transcendent discipline, transcendent miraculous abilities, and transcendent insight are all beyond measure.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་བཞིན་ གཤེགས་པ་ ནི་ བཞེད་ ན །_ |#| འཇིག་རྟེན་ གྱི་ [46b] ཁམས་ དེ་དག་ ཏུ་ གོམ་པ་ གཅིག་ གིས་ གཤེགས་པ ར་ མཛད་ ཀྱང་
en: Dṛḍhamati, if he so wishes, a thus-gone one [46.b] may traverse all those universes in a single step, and yet

source: དེ་བཞིན་ གཤེགས་པ འི་ སྤྱོད་ལམ་ རྣམ་པར་ འཁྲུག་པ ར་ ཡང་ མི་ འགྱུར་ ལ །_
en: neither will his conduct be rushed,

source: དེ་བཞིན་ གཤེགས་པ ས་ ད་དུང་ རྫུ་འཕྲུལ་ གྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ འི་ རྣམ་པ་ ཐམས་ཅད་ ཀུན་ ཏུ་ བསྟན་པ་ ཡང་ མ་ ཡིན་ ནོ །_།
en: nor will he have displayed the full extent of his transcendent, supernatural powers.

source: སེ་གོལ་ གཏོགས་ པ་ ཙམ་ གཅིག་ གིས་ ཀྱང་ བྱེ་མ འི་ ཕུང་པོ་ དེ་དག་ ཇི་སྙེད་ ཡོད་པ་ དེ་སྙེད་ ཁོ་ན འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ དག་ ཏུ་ གོམ་པ ས་ གཤེགས་པ་ གཅིག་ གིས་ གཤེགས་པ ར་ མཛད་ དོ །_།
en: Within the time of a finger-snap and with just one single step a thus-gone one can walk across all those universes—one universe for each grain of sand.

source: སེ་གོལ་ གཏོགས་པ་ ཙམ་ གྱི་ ཚུལ་ དེས་ ཀྱང་ ཤར་ཕྱོགས་ སུ་ གཤེགས་པ་ ནས །_ |#| ཕྱོགས་ བཅུ ར་ གཤེགས་པ འི་ བར་ གྱིས་
en: He can do so in the east, as well as in all the rest of the ten directions, and

source: ཞག་ གཅིག་ གམ །_ ཟླ་བ་ ཕྱེད་ དམ །_ ཟླ་བ་ གཅིག་ ནས་ ལོ་ གཅིག་ གི་ བར་ དུའམ །_ ལོ་ བརྒྱ་ ནས་ ལོ་ སྟོང་ ངམ །_ ལོ་ འབུམ་ གྱི་ བར་ དུ་ གཤེགས་པ ར་ མཛད་ ཅིང་ །_
en: he can do so for a day, a fortnight, a month, a year, a hundred years, a thousand years, or a hundred thousand years.

source: ཕྱོགས་ རེ་རེ ར་ ཡང་ ལོ་ བྱེ་བ་ ཕྲག་ འབུམ་ གྱི་ བར་ དུ་ གཤེགས་པ ར་ མཛད་ དོ །_།
en: He can walk throughout each direction for a hundred billion years.

source: བརྟན་ པ འི་ བློ་གྲོས་ འོ་ན་ དེ་ལྟ ར་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་དག་ ཇི་སྙེད་ ཡོད་པར་ དེ་བཞིན་ གཤེགས་པ ས་ བྱོན་པ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་དག་ མང་བ་ ཡིན་ ནམ །_
en: Well, Dṛḍhamati, would you say that the worlds that can thus be crossed by a thus-gone one are many?”

source: གསོལ་པ་
en: replied Dṛḍhamati.

source: བརྟན་པ འི་ བློ་གྲོས་ གལ་ཏེ་ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ དེ་ གཟུགས་ཅན་ ཞིག་ ཏུ་ གྱུར་ ན་ |#| ནི་ རེ་ཞིག་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་སྙེད་ དུ་ ཡང་ མི་ ཤོང་ སྟེ་
en: $246 “Dṛḍhamati,” |#| “if such merit had form it could not even be contained within all those universes.

source: ཕལ་ཆེ ར་ ལྷག་པ ར་ འགྱུར་ རོ །_།
en: It would be even larger.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་ལྟ ར་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཀྱིས་ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ གྲངས་མེད་པ་ དེ་ རབ་ཏུ་ མཁྱེན་ ཏེ །_
en: Dṛḍhamati, the thus-gone ones, the worthy ones, the perfect buddhas know all these heaps of merit completely.

source: དཔག་ ཏུ་ མེད་པ །_ བགྲང་ དུ་ མེད་པ །_ ཚད་ མེད་པ །_ བརྗོད་ དུ་ མེད་པ །_ བགྲང་བ་ ལས་ འདས་པ་ རབ་ཏུ་ མཁྱེན་ ཏོ །_།
en: Such merits are beyond measure, innumerable, limitless, ineffable, and beyond count, and yet the thus-gone one knows them completely.

source: བརྟན་པ འི་ བློ་གྲོས་ གང་ གིས་ བསོད་ནམས་ ཀྱི་ ཕུང་པོ་ དེ་ ཤེས་པ ར་ ནུས་པ འི་ ཡི་གེ འི་ གྲངས་ སམ །_ ཡིག་འབྲུ འི་ གྲངས་ སམ །_ བགྲང་བ འི་ གྲངས་ དེ་ |#| ངས་ རབ་ཏུ་ མི་ ཤེས་ ཏེ
en: Dṛḍhamati, I am not aware of any number of syllables, or any number of letters, or any number of digits that can convey the knowledge of such heaps of merit.

source: གཞན་ དུ་ ན་ གྲངས་མེད་པ འི་ གྲངས་ ཁོ་ན་ དང་ །_ དཔག་ ཏུ་ མེད་པ འི་ གྲངས་ ཁོ་ན ར་ འགྱུར་བ ར་ ཟད་ དོ །_།
en: In the end there would be nothing but innumerable numbers, numbers beyond measure.”

source: བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་པ་ དང་ དམ་པ འི་ ཆོས་ ཡོངས་སུ་ ཚོལ་བ འི་ བསོད་ནམས་ ཀྱི་ བསྔགས་པ་ བརྗོད་པ འི་ [47a] ལེའུ་ ཞེས་ བྱ་ སྟེ་ གསུམ་པ འོ །།_།།
en: $247 This concludes the third chapter. [47.a]
